{
  "backend/main.mo": "Empty Motoko actor serving as the backend entry point with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report documenting the replacement of the 'AR' placeholder logo with the Vayutaksha Consultancy logo image across App.tsx, PortfolioNav.tsx, and HeroSection.tsx.",
  "frontend-file-summaries.txt": "JSON map of frontend source files to short descriptions summarizing the purpose and recent changes of each component, data, config, and style file.",
  "frontend/index.css": "Tailwind CSS entry file defining CSS custom property tokens for light and dark color themes used throughout the application.",
  "frontend/index.html": "HTML entry point with Vayutaksha Consultancy SEO metadata including Open Graph and Twitter Card tags for aerospace branding.",
  "frontend/src/App.tsx": "Root app component composing all portfolio sections with decorative SVG dividers and a footer displaying the Vayutaksha logo image and copyright notice.",
  "frontend/src/components/PortfolioNav.tsx": "Responsive fixed navigation bar showing the Vayutaksha logo image, six nav links, a desktop CTA button, and a collapsible mobile menu.",
  "frontend/src/components/ProjectCard.tsx": "Card component rendering a project's image, title, and description without role or technology fields.",
  "frontend/src/components/SafeExternalLink.tsx": "Wrapper anchor component that enforces target='_blank' and rel='noopener noreferrer' on all external links.",
  "frontend/src/components/sections/AboutSection.tsx": "About section presenting Vayutaksha's description, two bullet highlights, and four capability cards covering FEA, multidisciplinary work, structural design, and mission-critical programs.",
  "frontend/src/components/sections/ContactSection.tsx": "Renders a contact section with email and phone links pulled from contactConfig, displayed as interactive cards with icons.",
  "frontend/src/components/sections/HeroSection.tsx": "Renders the hero section with a background image, decorative SVG mandala, company logo, headline, tagline, and smooth-scroll CTA buttons.",
  "frontend/src/components/sections/ResumeSection.tsx": "Renders a professional background section displaying a static summary of the consultancy's aerospace engineering credentials.",
  "frontend/src/components/sections/ServicesSection.tsx": "Renders a three-column services grid covering Structural Analysis & FEA, Aerospace Structural Design, and Facility & Lab Infrastructure Setup, each with icon, description, and engagement bullets.",
  "frontend/src/components/sections/TestimonialsSection.tsx": "Renders a two-column grid of four static client testimonial cards with quotes, author names, roles, and company names.",
  "frontend/src/components/sections/WorkSection.tsx": "Renders a featured projects grid by mapping over the projects data array and rendering a ProjectCard for each entry.",
  "frontend/src/config/contact.ts": "Exports a contactConfig object containing the consultancy's email, phone number, and tel-formatted phone string.",
  "frontend/src/data/projects.ts": "Defines the Project interface and exports an array of four aerospace project entries with titles, descriptions, images, and links.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication via DFINITY's AuthClient, exposing login/logout functions, identity state, and login status.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file reserved for future React Query hooks; currently exports nothing as the app has no backend data fetching.",
  "frontend/src/index.css": "Global stylesheet importing Google Fonts (Cormorant Garamond, Jost), configuring Tailwind base/components/utilities, and defining a warm earthy OKLCH CSS variable theme with light/dark modes and custom animations.",
  "frontend/src/main.tsx": "React app entry point that mounts the root component wrapped with TanStack QueryClientProvider and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with custom OKLCH-based color tokens, serif/sans font families, warm box shadows, and accordion keyframes, with typography, container-queries, and animate plugins.",
  "project_state.json": "Project state manifest (version 13) describing the Vayutaksha Consultancy aerospace portfolio site's requirements, architectural notes, existing features, and content/anonymization rules."
}