{
  "backend/main.mo": "Defines an empty Motoko actor with no logic implemented.",
  "feature_evidence.json": "Contains feature evidence data mapping project features to related files, components, and tests.",
  "frontend-file-summaries.txt": "Provides human‑written summaries of all frontend files for build planning.",
  "frontend/index.css": "Sets global Tailwind styles and OKLCH color variables for light and dark themes.",
  "frontend/index.html": "HTML entry point containing SEO metadata and bootstrapping the React app.",
  "frontend/src/App.tsx": "Main app component assembling all portfolio sections with dividers and a themed footer.",
  "frontend/src/components/PortfolioNav.tsx": "Responsive navigation bar with scroll-based styling and smooth section scrolling.",
  "frontend/src/components/ProjectCard.tsx": "Card component showing a project’s details and optional demo or repo links.",
  "frontend/src/components/SafeExternalLink.tsx": "Wrapper for secure external links using target=\"_blank\" and noopener noreferrer.",
  "frontend/src/components/sections/AboutSection.tsx": "Renders an About section with biography text, highlight cards, and a core competencies list. Uses mapped icon items and structured content blocks.",
  "frontend/src/components/sections/ContactSection.tsx": "Displays contact options including email, Calendly link, and social profiles using SafeExternalLink and config-driven data.",
  "frontend/src/components/sections/HeroSection.tsx": "Shows a hero banner with background imagery, branding, tagline, and buttons that smooth-scroll to sections.",
  "frontend/src/components/sections/ServicesSection.tsx": "Lists consulting services with icons, descriptions, and typical engagement items generated from a services array.",
  "frontend/src/components/sections/TestimonialsSection.tsx": "Renders client testimonials in a grid, each showing quote details and author information.",
  "frontend/src/components/sections/WorkSection.tsx": "Displays featured project cards by mapping over project data from the projects file.",
  "frontend/src/config/contact.ts": "Provides contact configuration including email, Calendly URL, and social profile links.",
  "frontend/src/data/projects.ts": "Defines a Project interface and exports an array of project case studies with descriptions, roles, and links.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages an authenticated or anonymous backend actor and invalidates related queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity auth, including loading, login, logout, and status state handling.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file reserved for future React Query hooks; currently exports nothing.",
  "frontend/src/index.css": "Defines global styles, Tailwind layers, CSS variables for the site’s color theme, and animation utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/tailwind.config.js": "Configures Tailwind with theme extensions, custom colors mapped to CSS variables, plugins, and design tokens.",
  "project_state.json": "Describes the project’s metadata, features, requirements, and image needs for the personal portfolio site."
}